; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v6 - type_1 ?v4 - type_3)
 	      (pred_4 ?v2 - object ?v4 - type_3)
	      (pred_3 ?v6 - type_1 ?v5 - type_2)
	      (pred_2 ?v6 - type_1 ?v2 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v6 - type_1 ?v7 ?v1 - type_3)
       :precondition (and  (pred_1 ?v6 ?v7))
       :effect (and  (pred_1 ?v6 ?v1)
		     (not (pred_1 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_1 ?v3 - object ?v8 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v8) (pred_1 ?v6 ?v8) (pred_3 ?v6 ?v5))
       :effect (and (pred_2 ?v6 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v8)) 
		    (not (pred_3 ?v6 ?v5))))

   (:action op_2
       :parameters (?v6 - type_1 ?v3 - object ?v8 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v3 ?v5) (pred_1 ?v6 ?v8))
       :effect (and (pred_4 ?v3 ?v8)
		    (pred_3 ?v6 ?v5)
		    (not (pred_2 ?v6 ?v3 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_1
obj_06 obj_09 - type_2
obj_08 obj_07 obj_10 obj_05 - type_3
obj_04 obj_02 obj_03 - object)
(:init
(pred_1 obj_01 obj_10)
(pred_3 obj_01 obj_06)
(pred_3 obj_01 obj_09)
(pred_4 obj_04 obj_07)
(pred_4 obj_02 obj_07)
(pred_4 obj_03 obj_10)
)
(:goal
(and
(pred_4 obj_04 obj_08)
(pred_4 obj_02 obj_05)
(pred_4 obj_03 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_01 ?b obj_09))))
)
)

; plan
1. (op_3 obj_01 obj_03 obj_10 obj_06)
   deleted: (pred_4 obj_03 obj_10) (pred_3 obj_01 obj_06)
   added: (pred_2 obj_01 obj_03 obj_06)
   goals met: 0 of 3
2. (op_1 obj_01 obj_10 obj_05)
   deleted: (pred_1 obj_01 obj_10)
   added: (pred_1 obj_01 obj_05)
   goals met: 0 of 3
3. (op_2 obj_01 obj_03 obj_05 obj_06)
   deleted: (pred_2 obj_01 obj_03 obj_06)
   added: (pred_4 obj_03 obj_05) (pred_3 obj_01 obj_06)
   goals met: 1 of 3
4. (op_1 obj_01 obj_05 obj_07)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_07)
   goals met: 1 of 3
5. (op_3 obj_01 obj_04 obj_07 obj_06)
   deleted: (pred_4 obj_04 obj_07) (pred_3 obj_01 obj_06)
   added: (pred_2 obj_01 obj_04 obj_06)
   goals met: 1 of 3
6. (op_1 obj_01 obj_07 obj_08)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_08)
   goals met: 1 of 3
7. (op_2 obj_01 obj_04 obj_08 obj_06)
   deleted: (pred_2 obj_01 obj_04 obj_06)
   added: (pred_4 obj_04 obj_08) (pred_3 obj_01 obj_06)
   goals met: 2 of 3
8. (op_1 obj_01 obj_08 obj_07)
   deleted: (pred_1 obj_01 obj_08)
   added: (pred_1 obj_01 obj_07)
   goals met: 2 of 3
9. (op_3 obj_01 obj_02 obj_07 obj_06)
   deleted: (pred_4 obj_02 obj_07) (pred_3 obj_01 obj_06)
   added: (pred_2 obj_01 obj_02 obj_06)
   goals met: 2 of 3
10. (op_1 obj_01 obj_07 obj_05)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_05)
   goals met: 2 of 3
11. (op_2 obj_01 obj_02 obj_05 obj_06)
   deleted: (pred_2 obj_01 obj_02 obj_06)
   added: (pred_4 obj_02 obj_05) (pred_3 obj_01 obj_06)
   goals met: 3 of 3
